<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1829202efb0695630e6cf350cf2922fbac8a86bf889b0dcca6fac1f09937e837","plan_job_ref":"Job Terraform Plan #328 at https://github.com/cal-itp/data-infra/actions/runs/16007645660","plan_out_hash":"b04f7f8cc69756860784e0df878d7f6c6abe56f5959e9ab80fb3378cd4686082","plan_hash":"fd2b46f1b472c690289f90801ddfe3433f06f18ca3fa213b58b56a5e7a576ef8","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_member.composer-service-account["roles/bigquery.dataOwner"] will be created
+   resource "google_project_iam_member" "composer-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "roles/bigquery.dataOwner"
    }

  # google_project_iam_member.composer-service-account["roles/bigquery.jobUser"] will be created
+   resource "google_project_iam_member" "composer-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.composer-service-account["roles/cloudbuild.builds.viewer"] will be created
+   resource "google_project_iam_member" "composer-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "roles/cloudbuild.builds.viewer"
    }

  # google_project_iam_member.composer-service-account["roles/composer.worker"] will be created
+   resource "google_project_iam_member" "composer-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "roles/composer.worker"
    }

  # google_project_iam_member.composer-service-account["roles/secretmanager.secretAccessor"] will be created
+   resource "google_project_iam_member" "composer-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.composer-service-account["roles/secretmanager.viewer"] will be created
+   resource "google_project_iam_member" "composer-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra"
+       role    = "roles/secretmanager.viewer"
    }

  # google_service_account.composer-service-account will be created
+   resource "google_service_account" "composer-service-account" {
+       account_id   = "************************"
+       description  = "Service account for Composer"
+       disabled     = false
+       display_name = "composer"
+       email        = "composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "cal-itp-data-infra"
+       unique_id    = (known after apply)
    }

  # google_service_account_iam_member.airflow-jobs_composer-service-account will be created
+   resource "google_service_account_iam_member" "airflow-jobs_composer-service-account" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "serviceAccount:cal-itp-data-infra.svc.id.goog[airflow-jobs/composer-service-account]"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

  # google_service_account_iam_member.custom_service_account will be created
+   resource "google_service_account_iam_member" "custom_service_account" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "serviceAccount:service-cal-itp-data-infra@cloudcomposer-accounts.iam.gserviceaccount.com"
+       role               = "roles/composer.ServiceAgentV2Ext"
+       service_account_id = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   google_service_account_composer-service-account_email                                                                                                                                                                         = "composer-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+   google_service_account_composer-service-account_id                                                                                                                                                                            = (known after apply)
+   google_service_account_composer-service-account_name                                                                                                                                                                          = (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #328](https://github.com/cal-itp/data-infra/actions/runs/16007645660)